profiling/get_wrk.txt
Running 30s test @ http://127.0.0.1:8080
  4 threads and 4 connections
  Thread calibration: mean lat.: 0.945ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.949ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.948ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.947ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  476.94us   5.00ms   60.76%
    Req/Sec     2.65k   158.95     3.33k    83.75%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.94ms
 75.000%    1.31ms
 90.000%    1.62ms
 99.000%    1.83ms
 99.900%    1.90ms
 99.990%    2.12ms
 99.999%    4.33ms
100.000%    5.00ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.024     0.000000            1         1.00
       0.262     0.100000        20016         1.11
       0.480     0.200000        40054         1.25
       0.694     0.300000        59988         1.43
       0.836     0.400000        79998         1.67
       0.944     0.500000        99994         2.00
       0.999     0.550000       110131         2.22
       1.054     0.600000       119983         2.50
       1.110     0.650000       129967         2.86
       1.203     0.700000       140005         3.33
       1.309     0.750000       150022         4.00
       1.364     0.775000       154976         4.44
       1.419     0.800000       159992         5.00
       1.472     0.825000       165046         5.71
       1.520     0.850000       169973         6.67
       1.572     0.875000       175002         8.00
       1.598     0.887500       177467         8.89
       1.625     0.900000       180012        10.00
       1.652     0.912500       182501        11.43
       1.679     0.925000       184972        13.33
       1.708     0.937500       187515        16.00
       1.722     0.943750       188800        17.78
       1.735     0.950000       189973        20.00
       1.749     0.956250       191275        22.86
       1.762     0.962500       192461        26.67
       1.776     0.968750       193716        32.00
       1.783     0.971875       194343        35.56
       1.790     0.975000       194986        40.00
       1.797     0.978125       195640        45.71
       1.804     0.981250       196230        53.33
       1.812     0.984375       196859        64.00
       1.816     0.985938       197137        71.11
       1.821     0.987500       197492        80.00
       1.825     0.989062       197755        91.43
       1.831     0.990625       198093       106.67
       1.837     0.992188       198415       128.00
       1.840     0.992969       198556       142.22
       1.844     0.993750       198726       160.00
       1.848     0.994531       198863       182.86
       1.853     0.995313       199029       213.33
       1.858     0.996094       199182       256.00
       1.861     0.996484       199249       284.44
       1.864     0.996875       199325       320.00
       1.868     0.997266       199408       365.71
       1.872     0.997656       199482       426.67
       1.877     0.998047       199553       512.00
       1.881     0.998242       199606       568.89
       1.883     0.998437       199634       640.00
       1.887     0.998633       199675       731.43
       1.893     0.998828       199709       853.33
       1.900     0.999023       199753      1024.00
       1.903     0.999121       199767      1137.78
       1.907     0.999219       199789      1280.00
       1.911     0.999316       199806      1462.86
       1.916     0.999414       199825      1706.67
       1.923     0.999512       199844      2048.00
       1.928     0.999561       199855      2275.56
       1.931     0.999609       199863      2560.00
       1.941     0.999658       199873      2925.71
       1.956     0.999707       199883      3413.33
       1.962     0.999756       199893      4096.00
       1.970     0.999780       199898      4551.11
       1.983     0.999805       199902      5120.00
       1.993     0.999829       199907      5851.43
       2.014     0.999854       199912      6826.67
       2.043     0.999878       199917      8192.00
       2.111     0.999890       199920      9102.22
       2.127     0.999902       199923     10240.00
       2.143     0.999915       199924     11702.86
       2.353     0.999927       199927     13653.33
       2.499     0.999939       199929     16384.00
       2.871     0.999945       199931     18204.44
       3.027     0.999951       199933     20480.00
       3.027     0.999957       199933     23405.71
       3.243     0.999963       199934     27306.67
       3.389     0.999969       199935     32768.00
       3.615     0.999973       199936     36408.89
       3.749     0.999976       199937     40960.00
       3.749     0.999979       199937     46811.43
       3.975     0.999982       199938     54613.33
       3.975     0.999985       199938     65536.00
       4.331     0.999986       199939     72817.78
       4.331     0.999988       199939     81920.00
       4.331     0.999989       199939     93622.86
       4.667     0.999991       199940    109226.67
       4.667     0.999992       199940    131072.00
       4.667     0.999993       199940    145635.56
       4.667     0.999994       199940    163840.00
       4.667     0.999995       199940    187245.71
       5.003     0.999995       199941    218453.33
       5.003     1.000000       199941          inf
#[Mean    =        0.946, StdDeviation   =        0.477]
#[Max     =        5.000, Total count    =       199941]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299986 requests in 30.00s, 19.13MB read
Requests/sec:   9999.58
Transfer/sec:    652.82KB